<%@ page language="java" pageEncoding="UTF-8"%>
<ul>
	<li>添加了ehcache功能，缓存了资源类型和BUG类型的数据</li>
	<li>修复菜单地址错误的时候，点击菜单，遮罩一直不消失的BUG</li>
	<li>增加一个图表演示功能，计算出某时间段用户注册数量</li>
	<li>修正用户登录中，自动补全登录和补全表格登录时，不能按回车进行登录的BUG</li>
	<li>修正用户管理中，点击任何操作按钮的时候，会记住以前选中过的行的BUG</li>
	<li>用户登录增加自动补全表格功能</li>
	<li>用户登录增加自动补全功能</li>
	<li>系统登录时，左侧菜单增加数据加载遮罩效果</li>
	<li>添加了用户可以查看自己的角色和权限功能</li>
	<li>修正角色管理中，越权管理角色的BUG</li>
	<li>修正给用户赋予角色时，可以赋予用户自己本角色之外的角色BUG</li>
	<li>修复删除角色时会刷新左侧菜单树的BUG</li>
	<li>左侧功能菜单点击的时候，弹出遮罩层</li>
	<li>修复了嵌套角色删除的BUG</li>
</ul>